Revit 2027 API
RiserToTreadConnectionOption Enumeration
 Represents the connection style of the riser and tread in relation to each other.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RiserToTreadConnectionOption
Public Enumeration RiserToTreadConnectionOption
public enum class RiserToTreadConnectionOption
type RiserToTreadConnectionOption
Members
Member name | Value | Description
JoinAll | 2 |  The connection will join all risers and treads.
RiserBehindTread | 0 |  The connection will extend riser behind tread.
TreadUnderRiser | 1 |  The connection will extend tread under riser.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace